2017/Migration To Dot Net/Port/Baseline/FB09907042101/WebClientsTest/html/testFindIntroducers_FsaIndividual.htm

<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML><HEAD><TITLE>Test Web Service</TITLE>
<META http-equiv=Content-Type content="text/html; charset=windows-1252">
<META content=http://schemas.microsoft.com/intellisense/ie5 
name=vs_targetSchema>
<META content="MSHTML 6.00.2900.2722" name=GENERATOR></HEAD>
<BODY>
<TABLE width="100%">
	<TBODY>
		<TR>
			<TD width="10%">URL</TD>
			<TD width="90%"><INPUT id=url style="WIDTH: 100%" name=url value="http://localhost/OmigaWebServices/FindIntroducersWS/OmigaFindIntroducersService.asmx"></TD>
		</TR>
		<TR>
			<TD>SOAP action</TD>
			<TD><INPUT id=soapAction style="WIDTH: 100%" value="http://Request.FindIntroducers.Omiga.vertex.co.uk"></TD>
		</TR>
	</TBODY>
</TABLE>
Data: 
<TEXTAREA id=requestData style="WIDTH: 100%" rows=12>
<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
<soap:Body>
<REQUEST xmlns="http://Request.FindIntroducers.Omiga.vertex.co.uk" USERAUTHORITYLEVEL="String" UNITID="String" CHANNELID="String" MACHINEID="String" PASSWORD="String" USERID="String">
	<INTRODUCERLIST FSAONLYINDIVIDUAL="1"/>
	<TARGETSEARCH INDIVIDUALSURNAME="de Ha*" INDIVIDUALFORENAME="A*"/>
	<LENGTHSEARCH>
		<FSAONLYINDIVIDUALLENGTH ALL="1"/>
	</LENGTHSEARCH>
</REQUEST>
</soap:Body>
</soap:Envelope>
</TEXTAREA>
<BUTTON id=post style="WIDTH: 100px" type=submit>Test</BUTTON> 
<BR><BR>Response: 
<TEXTAREA id=responseData style="WIDTH: 100%" rows=12></TEXTAREA>
<SCRIPT type=text/javascript>
		<!--
			function post.onclick()
			{
				responseData.innerText = "please wait ...";
				try
				{
					var x = new ActiveXObject("MSXML2.XMLHTTP.3.0");
					x.open("POST", url.value, false);
					x.setRequestHeader("Content-Type", "text/xml; charset=utf-8");
					if (soapAction.value == "")
						soapAction.value = '""';
					x.setRequestHeader("SOAPAction", soapAction.value);
					x.send(requestData.value);
					responseData.value = x.responseText;
				}
				catch (error)
				{
					alert(error.description);
				}
			}
		-->
		</SCRIPT>
 </BODY></HTML>
